{
    "関係代名詞(主格)": [
        "I have a friend who lives in Kyoto.",
        "This is the supermarket which opened last week.",
        "I have a friend who loves tennis.",
        "I have a friend that loves tennis.",
        "Do you know the girl who is singing now?",
        "Do you know the girl that is singing now?",
        "This is a book that explains English grammar well.",
        "This is a book which explains English grammar well.",
        "He lives in a house which was built by his father.",
        "He lives in a house that was built by his father.",
        "This is the only answer that is grammatically correct.",
        "This is the first accident that has occurred in this plant.",
        "All the books that are listed can be borrowed.",
        "There is no medicine that cures this disease.",
        "He talked about people and things that are important to him.",
        "Who that knows him will trust him?",
        "He passed the exam, which is not surprising.",
        "He said he liked her, which was not true."
    ],
    "関係代名詞(目的格)": [
        "This is the book which I bought yesterday.",
        "This is the house which he lived in last year.",
        "This is the house in which he lived last year.",
        "This is the man whom I met yesterday.",
        "This is the man who I met yesterday.",
        "This is the man that I met yesterday.",
        "Do you know the man whom Mary spoke to?",
        "Do you know the man who Mary spoke to?",
        "Do you know the man that Mary spoke to?",
        "Do you know the man to whom Mary spoke?",
        "This is the watch which my father gave me.",
        "This is the watch that my father gave me.",
        "This is the book which I spoke of yesterday.",
        "This is the book that I spoke of yesterday.",
        "This is the book of which I spoke yesterday.",
        "She is the woman I saw a movie with.",
        "She is the woman that I saw a movie with.",
        "She is the woman who I saw a movie with.",
        "She is the woman whom I saw a movie with.",
        "She is the woman with whom I saw a movie."
    ],
    "関係副詞": [
        "The city where I was born.",
        "This is the house where I lived.",
        "I remember the day when I met you first.",
        "Tell me the town where you grew up.",
        "Do you remember the day when you played tennis with Tom.",
        "I still remember the place where we first met.",
        "I visited the city where I was born and raised.",
        "This is the house where I grew up.",
        "I went to a sushi restaurant where a lot of famous people go.",
        "I’m going to the beach where I would go with my friends back in the day.",
        "This is the park where I often play with my son.",
        "I still remember the day when we first met.",
        "Do you remember the day when we started this band?",
        "That was the time when I realized that I had lost my smartphone.",
        "I'll never forget the moment when he hugged me.",
        "I miss the days when we used to go camping as a family every summer.",
        "That was the time when my business was struggling.",
        "I know the reason why he didn’t come here today.",
        "I don't know why he's always late for work.",
        "That's the reason why I decided to study abroad.",
        "I'm not sure why she's so upset.",
        "Do you know the reason why they are here?",
        "I can understand why he's so popular.",
        "I don’t remember why I said that to her.",
        "I don't know how he built this house by himself.",
        "I like the way he thinks.",
        "I’m not sure how that way works.",
        "I think that the way he acts is a bit childish.",
        "That is how I ended up settling down here.",
        "This is the way I do."
    ],
    "間接疑問文": [
        "I know what she likes.",
        "I don’t know when Ken is coming.",
        "I want to know who can get there.",
        "I wonder why she goes to school.",
        "Do you know what time it is?",
        "I don’t know who she is.",
        "I want to know who teaches them Japanese.",
        "I know what you said.",
        "I don’t know what she is doing right now.",
        "Mr. Tanaka asked me what happened to her.",
        "Do you know what food she likes?",
        "I don’t know where you want to visit next.",
        "My brother doesn’t know where the City Hall is.",
        "I forgot when I met her.",
        "I don’t know when your birthday is.",
        "He didn’t understand why she was angry.",
        "I asked him why he didn’t go to work.",
        "I want to know how she passed the exam.",
        "He asked how long it would take to get to the post office.",
        "Please tell me how many books you have."
    ],
    "同格that": [
        "The fact that he passed the exam surprised everyone.",
        "The fact that he succeeded surprised everyone.",
        "The fact that he apologized surprised everyone.",
        "The rumor spread that the famous player would transfer to another team next year.",
        "The news that she won the prize surprised everyone.",
        "The idea that we should work together is a good one."
    ],
    "関係代名詞(所有格)": [
        "We know the girl whose father is an artist.",
        "The woman whose brother we know is a pianist.",
        "The house whose fences are red is my friend's house.",
        "That is a house whose roof I repaired yesterday.",
        "The girl whose hair was brown was standing over there."
    ],
    
    "関係代名詞(前置詞あり)" :[
        "The house of which the fences are red is my friend's house."

    ],
    "関係代名詞(複数)test" :[

        "To what extent could leveraging, cutting-edge digital platforms increase global market share?",
        "To what extent should allocated, sufficient financial resources accelerate medical breakthroughs?",
        "The woman who is talking to the man I respect is the teacher whose class I take.",
        "The movie that we watched yesterday reminds me of the place I visited last year, which was beautiful.",
        "This is the reason I came here, and that is the house where I was born and raised.",
        
        "Mr. Tanaka, with whom I have worked for 10 years, is retiring next month.",
        "This antique vase, for which I paid a fortune, turned out to be a fake.",
        "The Grand Hotel, at which we stayed last summer, is closing down.",
        "This theory, on which his entire research is based, has been proven wrong.",
        "My grandmother, to whom I owe everything, passed away yesterday.",

        "Mr. Tanaka, who I have worked with for 10 years, is retiring next month.",
        "This antique vase, which I paid a fortune for, turned out to be a fake.",
        "The Grand Hotel, which we stayed at last summer, is closing down.",
        "This theory, which his entire research is based on, has been proven wrong.",
        "My grandmother, who I owe everything to, passed away yesterday.",

        "This is the topic to which she referred in her speech.",
        "The document to which you have access is confidential.",
        "I found the drawer in which the key was hidden.",
        "He is the only person on whom I can rely.",
        "There is a point beyond which we cannot go.",

        "This is the topic which she referred to in her speech.",
        "The document that you have access to is confidential.",
        "I found the drawer which the key was hidden in.",
        "He is the only person who I can rely on.",
        "There is a point which we cannot go beyond.",

        "The mountain, on whose summit snow always remains, is beautiful.",
        "The author, in whose books I am interested, will visit our town.",
        "The author, whose books I am interested in, will visit our town.",
        "I met a man in whose care I left my dog.",

        "He finally gave up, which surprised everyone.",
        "She came in, which made him happy.",
        "Everything depends on what you decide.",
        "They are looking for what caused the accident."
    ],
    "形式主語" :[

    ],
    "強調構文" :[

    ]
    
    
}