{
    "関係代名詞または関係副詞またはto不定詞または仮定法": [
        "This is the book which I borrowed from the library.",
        "The man who lives next door is a doctor.",
        "I met a girl whose brother is a famous singer.",
        "She showed me the painting that she bought yesterday.",
        "He is the person whom I told you about.",
        "The car, which was red, sped down the street.",
        "I don't like people who talk too loudly.",
        "Do you know the student whose essay won the prize?",
        "This is the house that Jack built.",
        "We saw a movie which was very exciting.",
        "He has a dog that loves to play fetch.",
        "The woman whom you saw is my sister.",
        "I bought a new phone, which cost a lot of money.",
        "Anyone who wants to join should sign up here.",
        "She wore a dress whose color matched her eyes.",
        "The problems that we face are complex.",
        "My friend, who is an artist, designed this logo.",
        "I read a book which made me cry.",
        "He returned the money that he had borrowed.",
        "The company whose products are innovative will succeed.",
        "I remember the day when we first met.",
        "This is the place where we used to play.",
        "Tell me the reason why you are late.",
        "That's how he solved the difficult puzzle.",
        "Do you know a restaurant where we can get good sushi?",
        "I'll never forget the time when I visited Japan.",
        "The store where I bought this jacket is now closed.",
        "Is there any particular reason why you said that?",
        "She explained the method how she learned English so quickly.",
        "We arrived at the hotel where our reservation was made.",
        "The moment when I realized my mistake was awful.",
        "I wonder why he didn't come to the party.",
        "Show me the park where you walk your dog.",
        "This is the year when the Olympics will be held.",
        "He explained the reason why the project failed.",
        "I like the way how she organizes her work.",
        "Let's go to a cafe where we can talk privately.",
        "There was a time when I believed in magic.",
        "The explanation why he resigned was unclear.",
        "I want to know the place where you grew up.",
        "I want to learn a new language.",
        "It's important to study every day.",
        "My dream is to travel around the world.",
        "He came here to see his parents.",
        "She has a lot of homework to do.",
        "I was happy to hear the news.",
        "It was kind of you to help me.",
        "He worked hard only to fail the exam.",
        "To be honest, I don't remember him.",
        "This is a difficult problem for me to solve.",
        "We decided to postpone the meeting.",
        "She seemed to be upset about something.",
        "He offered to carry my bags.",
        "I need something to drink.",
        "We hurried to catch the last train.",
        "To tell the truth, I forgot her name.",
        "It's difficult to live in a foreign country.",
        "He promised not to be late again.",
        "I have nothing to say to you.",
        "She is too tired to continue working.",
        "We need to find a solution quickly.",
        "My goal is to become a successful writer.",
        "They went to the beach to relax.",
        "This is the best way to learn English.",
        "I'm sorry to bother you.",
        "For him to succeed, he needs to work harder.",
        "It's crucial for us to understand this.",
        "I regret to inform you that you failed.",
        "She managed to finish the project on time.",
        "He pretended to be asleep.",
        "If I were rich, I would buy a big house.",
        "If she had studied harder, she would have passed the exam.",
        "I wish I could fly like a bird.",
        "If it rains tomorrow, we will stay home.",
        "If I knew his address, I would visit him.",
        "If you had called me, I would have helped you.",
        "I wish I hadn't said that.",
        "He acts as if he were the boss.",
        "If I were you, I wouldn't do that.",
        "If the weather had been better, we would have gone hiking.",
        "If you go, I will go too.",
        "If he were here, he would tell us what to do.",
        "I wish it were summer now.",
        "She spoke as though she had known him for years.",
        "If it were not for your help, I couldn't finish it.",
        "If you eat too much, you will get sick.",
        "If I had known that, I would have acted differently.",
        "I wish I had more time to read.",
        "It's time we went home.",
        "If I were able to choose, I would live by the sea.",
        "If they arrive late, we'll start without them.",
        "If he had listened to my advice, he wouldn't be in trouble now.",
        "I wish I had brought an umbrella.",
        "If I found a wallet, I would return it.",
        "If it had not been for the traffic, we would have arrived on time.",
        "If you heat ice, it melts.",
        "Were I a millionaire, I would donate to charity.",
        "I wish that I knew the answer.",
        "Supposing he fails, what will he do?",
        "If you don't hurry, you'll miss the bus."
    ],
    "関係代名詞または関係副詞またはto不定詞または仮定法または同格that": [
        "The man who lives next door is a doctor.",
        "This is the cafe where we first met.",
        "I have a lot of work to do.",
        "If I were a bird, I would fly to you.",
        "The fact that he survived was a miracle.",
        "She showed me the book which she was reading.",
        "He went to the store to buy some milk.",
        "If you had studied harder, you would have passed.",
        "Her idea that they should travel was brilliant.",
        "Can you tell me the reason why you left?",
        "We need a quiet place to talk.",
        "I wish I could speak Japanese fluently.",
        "The car that is parked outside is mine.",
        "His claim that he saw a UFO was ridiculed.",
        "I was happy to see her again.",
        "If it were sunny, we would go for a walk.",
        "He is the student whose project won the award.",
        "There are many issues to discuss.",
        "The announcement that the concert was postponed disappointed fans.",
        "Do you remember the day when we first met?",
        "I wish I had more time for hobbies.",
        "She worked hard to achieve her goals.",
        "The person whom I met at the party was very kind.",
        "The belief that everyone deserves a second chance is strong.",
        "If I knew the answer, I would tell you.",
        "She has a difficult decision to make.",
        "This is the city where I grew up.",
        "The news that she got married surprised everyone.",
        "If she had called, I would have answered.",
        "They met to discuss their future plans.",
        "This is the dog that barks every morning.",
        "The theory that parallel universes exist is fascinating.",
        "I wish I were on a tropical island.",
        "I need something hot to drink.",
        "That's the restaurant where they serve the best pizza.",
        "His hope that he would win the lottery never faded.",
        "If we had left earlier, we wouldn't have missed the train.",
        "She was thrilled to receive the invitation.",
        "The movie which you recommended was excellent.",
        "The fact that he never apologized still bothers her.",
        "If I could fly, I would travel the world.",
        "There's nothing to worry about.",
        "This is the year when I graduated from college.",
        "The news that the company was expanding was welcomed.",
        "I wish I had listened to my mother's advice.",
        "He saved money to buy a new computer.",
        "She is the only one who truly understands me.",
        "The possibility that the project might fail worried everyone.",
        "If they were here, they would help us.",
        "I have a lot of emails to reply to.",
        "Autumn is the season when the leaves change color.",
        "His argument that the system was flawed was compelling.",
        "I wish it weren't raining so heavily.",
        "He studied hard only to fail the exam.",
        "The song that we heard on the radio was amazing.",
        "If she had known about the surprise party, she would have come.",
        "The observation that the universe is constantly expanding is profound.",
        "This is a complex problem to solve.",
        "I want to know the exact place where you found it.",
        "If I were you, I would take that job.",
        "The report that sales had increased boosted morale.",
        "She called to confirm her reservation.",
        "The artist whose paintings are exhibited is very talented.",
        "I wish I had more courage.",
        "The proof that he was innocent was undeniable.",
        "We need a strong leader to guide the country.",
        "That's the reason why he resigned from his position.",
        "If it were possible, I would learn every language.",
        "The warning that the storm was approaching was issued.",
        "I'm sorry to bother you.",
        "The challenges which we face are significant.",
        "If he had trained harder, he might have won the competition.",
        "Her conviction that she could succeed was inspiring.",
        "I have nothing else to add.",
        "Tell me the moment when you realized the truth.",
        "I wish I could play the piano.",
        "The promise that he would return was never kept.",
        "They gathered to celebrate their victory.",
        "He introduced me to his brother, whom I had never met.",
        "If I had a map, I wouldn't be lost.",
        "The suggestion that we try a new strategy was accepted.",
        "There are many new skills to learn.",
        "This is the house where I spent my childhood.",
        "I wish I knew how to fix this.",
        "The fact that she speaks five languages is impressive.",
        "She exercises daily to stay fit.",
        "The device that you are holding is cutting-edge.",
        "If I were in charge, I would make some changes.",
        "His excuse that he forgot was not convincing.",
        "I have a pile of books to read.",
        "That's the reason why he quit.",
        "If it hadn't snowed, we would have gone skiing.",
        "The notion that money can buy happiness is debatable.",
        "We were delighted to hear about your engagement.",
        "The team which won the championship celebrated all night.",
        "I wish I had bought that house.",
        "The consensus that teamwork is crucial is widely accepted.",
        "Is there anything else to discuss?",
        "Can you recall the year when the internet became mainstream?",
        "If I could turn back time, I would re-live that day."
    ],
    "関係代名詞または関係副詞またはto不定詞または仮定法または同格that,比較級,過去形": [
        "If I were a bird, I would fly to you.",
        "She is the woman who taught me to play piano.",
        "He went to the library to study for his exam.",
        "The news that he had arrived spread quickly.",
        "My car is faster than yours.",
        "We visited Paris last summer.",
        "This is the place where we first met.",
        "If you had called me, I would have come.",
        "It's important to listen carefully.",
        "I like the idea that we can make a difference.",
        "She is as talented as her sister.",
        "They walked home in silence.",
        "The book which you recommended was excellent.",
        "I wish I could speak French fluently.",
        "He needs to finish his homework.",
        "The belief that hard work pays off is common.",
        "This coffee is much hotter than I expected.",
        "I saw a shooting star last night.",
        "Tell me the reason why you left so early.",
        "If it rains tomorrow, we will stay inside.",
        "We have a lot of work to do.",
        "He dismissed the argument that it was too expensive.",
        "The more you practice, the better you become.",
        "She was singing when I entered the room.",
        "The student whose essay won the prize was ecstatic.",
        "Were I in your shoes, I would apologize.",
        "It's a great opportunity to learn something new.",
        "The theory that time travel is possible fascinates me.",
        "He's not as strong as he looks.",
        "They had already eaten dinner by the time we arrived.",
        "Do you remember the day when we graduated?",
        "If she had known, she would have told you.",
        "My goal is to become a doctor.",
        "The fact that he lied bothered me deeply.",
        "This task is less difficult than the previous one.",
        "I used to live in London.",
        "The movie that we watched last night was fantastic.",
        "I wish I had studied harder for the test.",
        "She paused to catch her breath.",
        "They celebrated the news that their team had won.",
        "He drives more carefully than his brother.",
        "We saw a beautiful sunset yesterday.",
        "Can you show me the place where you found it?",
        "If I win the lottery, I will buy a new house.",
        "He pretends to be happy.",
        "The rumor that she was leaving was false.",
        "This city is much noisier than my hometown.",
        "I was sleeping when the phone rang.",
        "The woman whom I saw at the party was your sister.",
        "If they had left earlier, they wouldn't have missed the flight.",
        "She refused to accept his apology.",
        "The evidence that he was guilty was overwhelming.",
        "Her performance was better than expected.",
        "They had never seen such a beautiful sight before.",
        "I don't understand why he acted that way.",
        "I wish I were taller.",
        "He has a talent to make people laugh.",
        "The knowledge that he was safe brought relief.",
        "This phone is more expensive than the last model.",
        "I spent my childhood in a small village.",
        "The car which broke down was ours.",
        "If I knew her number, I would call her.",
        "We decided to go out for dinner.",
        "The fear that she might fail kept her awake.",
        "He is much older than he looks.",
        "She did not go to the party.",
        "Let's choose a time when everyone can meet.",
        "If he were here, he would help us.",
        "It's easy to make mistakes.",
        "The thought that he might be lying crossed my mind.",
        "Learning a new language is harder than I thought.",
        "I had already packed my bags.",
        "He is the engineer who designed the bridge.",
        "I wish I hadn't eaten so much.",
        "They managed to escape from the burning building.",
        "The certainty that he would succeed gave him confidence.",
        "My computer is slower than yours.",
        "She drove to work every day last year.",
        "Tell me the exact location where the accident happened.",
        "If you try hard, you will succeed.",
        "I have nothing to say.",
        "He announced the decision that the project would continue.",
        "This jacket is not as warm as the other one.",
        "We were watching a movie when the power went out.",
        "The dog whose owner just moved is very sad.",
        "If I had listened to you, I wouldn't be in this mess.",
        "It's difficult to understand him.",
        "The hope that they would reconcile remained strong.",
        "The more electricity you use, the higher your bill will be.",
        "I had never tasted sushi before that day.",
        "Is there a reason why you're so quiet?",
        "If she knew the truth, she would be angry.",
        "He promised to call me back.",
        "The warning that a storm was approaching was ignored.",
        "Her new book is more compelling than her previous works.",
        "She sang beautifully at the concert.",
        "The restaurant which serves the best pasta is downtown.",
        "I wish it weren't raining so we could go out.",
        "He offered to help me move.",
        "The discovery that ancient civilizations existed there was groundbreaking.",
        "My old phone was much bigger than this one.",
        "They arrived late for the meeting.",
        "Let's find a quiet place where we can talk.",
        "If I had more time, I would learn a new language.",
        "He has a strong desire to succeed.",
        "The report that sales had dropped worried the board.",
        "This exercise is less challenging than the last.",
        "I read that book last month.",
        "The person who called me yesterday was my old friend.",
        "If I were you, I would take that job offer.",
        "It's hard to believe his story.",
        "The assumption that everyone understood was incorrect.",
        "The city is getting warmer every year.",
        "She was laughing at his jokes.",
        "He remembers the year when he moved to Japan.",
        "If he had seen me, he would have said hello.",
        "We are happy to announce our engagement.",
        "I shared my opinion that the plan was flawed.",
        "He runs faster than anyone else in the team.",
        "They had already left by the time I arrived.",
        "The painting which hangs in the living room is valuable.",
        "I wish I had a pet.",
        "There's nothing to fear.",
        "The idea that he might be innocent gave us hope.",
        "This road is much narrower than the main highway.",
        "I spent a lot of money on that jacket.",
        "That's the restaurant where we celebrated our anniversary.",
        "If she studies hard, she will pass the exam.",
        "He decided to become a vegetarian.",
        "The realization that he was wrong hit him hard.",
        "The journey was longer than we expected.",
        "She worked as a teacher for ten years.",
        "The man whose car was stolen reported it to the police.",
        "If I won the lottery, I would donate half to charity.",
        "He has a tendency to procrastinate.",
        "The request that she reconsider her decision was denied.",
        "This cake is sweeter than the last one I baked.",
        "I had never tasted such delicious food.",
        "Can you explain the reason why the sky is blue?",
        "If it weren't for you, I would be lost.",
        "We need to hurry up.",
        "The belief that ghosts exist is common in some cultures.",
        "This movie is funnier than the one we watched yesterday.",
        "She cooked a delicious meal for us.",
        "The company that manufactures these phones is based in Korea.",
        "I wish I could turn back time.",
        "They learned to swim quickly.",
        "The news that the economy was recovering lifted spirits.",
        "My new apartment is brighter than my old one.",
        "He used to play basketball every weekend.",
        "Remember the day when we first met at the park?",
        "If you had told me earlier, I could have helped.",
        "It's good to see you again.",
        "He ignored the advice that he should be more careful.",
        "The colder it gets, the more clothes I need.",
        "We were discussing our plans for the vacation.",
        "The scientist whom they interviewed was a Nobel laureate.",
        "If he were to call now, I wouldn't be surprised.",
        "I have an important meeting to attend.",
        "The possibility that they might fail was always present.",
        "This route is shorter than the one we usually take.",
        "She finished her degree two years ago.",
        "Do you know the exact time when the train departs?",
        "If I had a million dollars, I would retire.",
        "He tried to open the locked door.",
        "The promise that he would return was never kept.",
        "My little brother is taller than me now.",
        "They had lived in that house for twenty years.",
        "The city which I visited last year was very beautiful.",
        "I wish I had brought an umbrella.",
        "She wants to travel the world.",
        "The command that they should evacuate was issued immediately.",
        "This new smartphone is more powerful than my old laptop.",
        "We ate dinner at a fancy restaurant last night.",
        "He often thinks about the time when he was a child.",
        "If you don't hurry, you will miss the bus.",
        "It's a great day to go for a walk.",
        "The thought that he might be in danger terrified her.",
        "The ocean is much deeper than any lake.",
        "I was listening to music when I fell asleep.",
        "The artist whose work is displayed here is famous.",
        "If I could sing, I would join a choir.",
        "She decided to learn a new skill.",
        "The news that their project was approved delighted everyone.",
        "This problem is less complex than the one we solved yesterday.",
        "They had already seen that movie.",
        "Can you point to the place where the treasure is buried?",
        "If she had applied, she would have gotten the scholarship.",
        "He stopped to tie his shoelace.",
        "The fact that he confessed surprised the police.",
        "This book is as long as that one.",
        "We went to the beach last weekend.",
        "The friend whom I met for coffee was really happy.",
        "I wish I had more free time.",
        "It's nice to meet you.",
        "The agreement that they would cooperate was finally reached.",
        "My current job is more fulfilling than my previous one.",
        "She was studying hard for her final exams.",
        "He never understood the reason why she left him.",
        "If I were a millionaire, I would buy an island."
    ],
    "関係代名詞または関係副詞またはto関節疑問文": [
        "The man who called you yesterday left a message.",
        "I bought a new phone which has a great camera.",
        "This is the house where I spent my childhood.",
        "Do you remember the day when we first met?",
        "She doesn't know what to do next.",
        "He went to the store to buy some bread.",
        "The car that is parked outside is mine.",
        "My sister, who lives in London, visits us often.",
        "That's the reason why I was late.",
        "Can you tell me how to get to the station?",
        "We have a lot of work to finish today.",
        "The movie which we watched last night was fantastic.",
        "The woman whose dog barked all night apologized.",
        "This is the cafe where we had our first date.",
        "I'm not sure when to leave.",
        "He studied hard to pass the exam.",
        "The student whom I met at the conference was very bright.",
        "The book that you recommended was excellent.",
        "Tokyo, where the Olympics were held, is a vibrant city.",
        "There are many exciting places to visit.",
        "She couldn't decide what to wear.",
        "We need to find a quiet place to talk.",
        "The company which developed this software is famous.",
        "My friend, whose parents are doctors, is studying medicine.",
        "Is there a specific reason why you're here?",
        "He taught me how to play the guitar.",
        "I have nothing to hide.",
        "The dog that chased the cat belongs to my neighbor.",
        "She gave me a present which I really liked.",
        "The year when I graduated was memorable.",
        "I'm looking for a tool to fix this.",
        "They discussed where to invest their money.",
        "The artist who painted this picture is very talented.",
        "The concert, which was held outdoors, was rained out.",
        "The village where my grandparents live is peaceful.",
        "He explained why the project failed.",
        "We need to learn how to adapt.",
        "I have an important announcement to make.",
        "The information that you provided was helpful.",
        "My cousin, whom I haven't seen in years, is coming to visit.",
        "That's the restaurant where we celebrated our anniversary.",
        "I don't know who to ask for help.",
        "She bought a new dress to wear to the party.",
        "The theory which he proposed was revolutionary.",
        "The boy whose bike was stolen reported it to the police.",
        "Tell me the reason why you changed your mind.",
        "We need to decide what to do for dinner.",
        "It's a beautiful day to go for a walk.",
        "The bird that built a nest in our tree laid eggs.",
        "My boss, who is always busy, took time to listen.",
        "This is the place where historical events unfolded.",
        "I'm wondering when to call him.",
        "They need someone to guide them.",
        "The problem which they faced was complex.",
        "The team whose performance improved won the championship.",
        "Can you explain the reason why the sky is blue?",
        "He showed us how to build a fire.",
        "I have a lot of emails to respond to.",
        "The movie that we saw was a comedy.",
        "The girl whom you saw earlier is my sister.",
        "This is the moment when destiny changes.",
        "I need a place to store these boxes.",
        "She couldn't figure out where to park.",
        "The company which I work for offers great benefits.",
        "My grandmother, whose wisdom I admire, always tells great stories.",
        "I never understood the reason why they broke up.",
        "Let's think about what to do this weekend.",
        "They are trying to find a solution to the problem.",
        "The dog that barks the loudest is usually the smallest.",
        "The new bridge, which connects the two cities, is impressive.",
        "Is this the exact spot where it happened?",
        "I'm confused about who to believe.",
        "We need more resources to complete the task.",
        "The advice which he gave me was invaluable.",
        "The author whose latest book sold millions is on tour.",
        "He finally understood why she was upset.",
        "I'm learning how to code.",
        "There's nothing to worry about.",
        "The car that broke down belonged to my uncle.",
        "My professor, whom I respect deeply, is retiring next year.",
        "I'll never forget the year when I traveled to Japan.",
        "She called her mother to share the good news.",
        "We need to decide when to start the project.",
        "The painting which was stolen was recovered.",
        "The children whose parents are away are staying with us.",
        "I wonder why the train is delayed.",
        "Can you show me how to open this jar?",
        "I have too many things to do.",
        "The person that you are looking for is not here.",
        "My neighbor, who is a keen gardener, grows beautiful roses.",
        "This is the quiet corner where I like to read.",
        "I'm trying to figure out what to cook for dinner.",
        "They decided to postpone the meeting to discuss it further.",
        "The project which failed cost a lot of money.",
        "The woman whom he married is a famous actress.",
        "That's the reason why I love this city.",
        "I don't know where to turn.",
        "We have a goal to achieve.",
        "The story that she told was quite unbelievable.",
        "My best friend, whose opinion I trust, agreed with me.",
        "The summer when I turned eighteen was unforgettable.",
        "He paused to catch his breath.",
        "They are debating what to name their new pet.",
        "The movie theater where we usually go is closed.",
        "She is someone to look up to.",
        "The report which was submitted yesterday needs revision.",
        "The students whose names are on the list passed.",
        "I need to understand the reason why this happened.",
        "Do you know how to fix a flat tire?",
        "He needs more time to complete his tasks.",
        "The restaurant that we visited last week was excellent.",
        "My brother, who lives abroad, sent me a postcard.",
        "This is the moment when silence speaks volumes.",
        "We are looking for somewhere to stay.",
        "She asked what to bring to the potluck.",
        "He studied French to work in France.",
        "The book which changed my life was \"Sapiens\".",
        "The person whose car broke down called for a tow truck.",
        "That's the reason why the market crashed.",
        "I'm trying to learn how to juggle.",
        "I have a lot of new ideas to develop.",
        "The email that I received contained important information.",
        "My aunt, whom I adore, sent me a birthday gift.",
        "This is the park where we used to have picnics.",
        "We need to decide when to launch the product.",
        "She left early to catch her flight.",
        "The document which needs to be signed is on your desk.",
        "The neighbor whose fence was damaged filed a complaint.",
        "Can you tell me the reason why you chose this path?",
        "They are learning how to manage stress.",
        "There's nothing else to discuss.",
        "The house that overlooks the lake is for sale.",
        "My colleague, who is very efficient, helped me out.",
        "I remember the exact spot where we found the treasure.",
        "He isn't sure who to trust.",
        "We need to save money to buy a house.",
        "The painting which was auctioned off fetched a high price.",
        "The author whose lecture I attended was inspiring.",
        "I don't understand the reason why he resigned.",
        "She showed me how to solve the puzzle.",
        "I have a new skill to learn.",
        "The project that we are working on is challenging.",
        "My friend, whom I respect, gave me good advice.",
        "The day when the war ended was celebrated worldwide.",
        "He picked up his phone to check messages.",
        "We need to figure out what to do with the leftovers.",
        "The software which was updated has new features.",
        "The family whose house burned down received support.",
        "Tell me the main reason why you disagree.",
        "He's good at knowing when to speak and when to be silent.",
        "I have a question to ask.",
        "The film that won the award was controversial.",
        "My teacher, who is very patient, explains everything clearly.",
        "This is the museum where ancient artifacts are displayed.",
        "They need to learn where to find reliable information.",
        "She packed a lunch to eat at work.",
        "The car which I want to buy is a hybrid.",
        "The student whose grades improved significantly won a scholarship.",
        "The police are investigating the reason why the accident occurred.",
        "I need to know how to properly cite sources.",
        "There are many opportunities to explore.",
        "The news that I heard was shocking.",
        "My neighbor, whom I often chat with, is moving.",
        "I'll never forget the night when we saw the aurora borealis.",
        "We need someone to lead the team.",
        "She wasn't sure what to expect.",
        "He opened the window to let in some fresh air.",
        "The concert which featured a guest artist was amazing.",
        "The tree whose leaves turn red in autumn is beautiful.",
        "Can you give me a good reason why I should trust you?",
        "They are teaching children how to read.",
        "I have a dream to pursue.",
        "The proposal that he submitted was rejected.",
        "My cat, who loves to sleep, is currently napping.",
        "This is the laboratory where groundbreaking research takes place.",
        "I wonder when to announce the winners.",
        "He took a break to stretch his legs.",
        "The documentary which explored ocean life was fascinating.",
        "The couple whose wedding I attended looked very happy.",
        "I understand the reason why you feel that way.",
        "She taught her dog how to fetch.",
        "There are many books to read on this topic.",
        "The decision that they made was difficult.",
        "My uncle, whom I admire, is a brave firefighter.",
        "The era when technology advanced rapidly was exciting.",
        "We need to choose where to hold the next meeting.",
        "He saved money to travel the world.",
        "The app which I downloaded helps me organize my tasks.",
        "The child whose artwork won the competition was very proud.",
        "What's the reason why the lights are off?",
        "I don't know who to believe anymore.",
        "I have an important call to make.",
        "The problem that she described was complex.",
        "My parents, who are celebrating their anniversary, are going on a cruise.",
        "This is the exact moment when everything changed.",
        "She went to the doctor to get a check-up.",
        "The report which was leaked caused a scandal.",
        "The students whose project was chosen received an award.",
        "I'm trying to figure out how to solve this equation.",
        "There's so much to learn in life."
    ],
    "関係代名詞,関係副詞,同格that,その他40個": [
        "The person who called me was my old teacher.",
        "She bought a dress which was on sale.",
        "I remember the day when we first met.",
        "This is the hospital where I was born.",
        "The reason why he resigned is still unknown.",
        "The news that she passed the exam made us happy.",
        "I wish I could speak French fluently.",
        "If I had more time, I would travel the world.",
        "English is spoken by millions of people worldwide.",
        "The book was written by a famous author.",
        "I have been studying English for ten years.",
        "She had already finished her work when I arrived.",
        "To master a language takes time and effort.",
        "Reading books is my favorite pastime.",
        "Walking in the rain, I felt refreshed.",
        "He is taller than his sister.",
        "This is the most challenging task I've ever faced.",
        "You must be very tired after the long flight.",
        "We should always try to do our best.",
        "I used to play tennis every weekend.",
        "The sun rises in the east.",
        "He drives carefully on the snowy roads.",
        "She is a very intelligent and diligent student.",
        "They made him their leader.",
        "I saw her dancing gracefully on the stage.",
        "Never have I heard such a beautiful melody.",
        "Not only did he apologize, but he also offered to help.",
        "It was John who suggested the idea.",
        "It is essential to stay hydrated.",
        "He made it clear that he would not tolerate delays.",
        "The heavy snow prevented us from going out.",
        "You like chocolate, don't you?",
        "I wonder what time the store opens.",
        "Don't you want to join us for dinner?",
        "She put off the meeting until next week.",
        "He said that he was busy yesterday.",
        "The student whose essay won the prize is very talented.",
        "This is the restaurant where we had our first date.",
        "Do you know the reason why the project failed?",
        "The fact that she never gives up inspires me.",
        "If I were you, I would take that opportunity.",
        "The car, which was red, sped down the highway.",
        "Anyone who finishes early can leave.",
        "This is the museum where ancient artifacts are displayed.",
        "The rumor that the company is merging is false.",
        "I regret not having studied harder.",
        "She avoids eating fast food.",
        "Having completed the assignment, I relaxed.",
        "The more you learn, the more you realize you don't know.",
        "He might come if he finishes his work early.",
        "You ought to apologize for your mistake.",
        "I am looking forward to hearing from you.",
        "Despite the rain, they went hiking.",
        "She goes to the gym to stay fit.",
        "He watched the children playing in the park.",
        "It is believed that aliens exist.",
        "The committee suggested that the plan be reviewed.",
        "This is the kind of music that I enjoy listening to.",
        "The city where I grew up has changed significantly.",
        "The idea that dreams predict the future is interesting.",
        "If you had told me, I would have come.",
        "By the time you arrive, I will have cooked dinner.",
        "They were surprised by the news that he had quit.",
        "He made me laugh with his funny stories.",
        "The decision to postpone the event was necessary.",
        "The girl wearing the red dress is my cousin.",
        "He looked happy, smiling brightly.",
        "She runs as fast as a cheetah.",
        "The higher you climb, the colder it gets.",
        "You needn't worry about the presentation.",
        "We had better leave now, or we'll be late.",
        "I saw him cross the street.",
        "She let her children play outside.",
        "He is such an eloquent speaker that everyone listens.",
        "It is widely known that exercise is good for health.",
        "This is the book about which I told you.",
        "He questioned the claim that the product was organic.",
        "The place where they met was a small cafe.",
        "The theory that time travel is possible fascinates me.",
        "If it weren't for your help, I couldn't have finished.",
        "We insisted that he (should) attend the meeting.",
        "The house, which has a big garden, is for sale.",
        "He talked as if he were an expert.",
        "The window was broken by the strong wind.",
        "The experiment had been completed before sunset.",
        "He regrets having wasted so much time.",
        "They observed him working diligently.",
        "This is the most delicious cake I've ever tasted.",
        "He can speak not only English but also Spanish.",
        "He made her feel comfortable.",
        "So difficult was the exam that few students passed.",
        "I couldn't help laughing at his joke.",
        "She suggested that we (should) go for a walk.",
        "The man whose car was stolen reported it to the police.",
        "The restaurant where we ate was excellent.",
        "The fact that she is fluent in three languages is amazing.",
        "If only I knew the answer!",
        "He wants to know when the train will arrive.",
        "The team, which consists of young players, won the championship.",
        "She explained why she was upset.",
        "The evidence that he committed the crime was insufficient.",
        "I recommend that you (should) try this dish.",
        "The boy whom I met yesterday is very polite.",
        "This is the park where we had our picnic.",
        "The news that the company laid off workers was shocking.",
        "If you had studied harder, you would have passed.",
        "I have been waiting for you for an hour.",
        "He avoided being seen by anyone.",
        "Being tired, she went to bed early.",
        "He is very much interested in art.",
        "She ought to be more careful.",
        "I look forward to visiting Japan again.",
        "Although it was late, he continued working.",
        "He went to the library in order to borrow some books.",
        "She hears her name being called.",
        "It is said that honesty is the best policy.",
        "The student who scored the highest received a scholarship.",
        "He showed me the house that he had bought.",
        "The city where the Olympics will be held is Tokyo.",
        "The belief that hard work pays off is common.",
        "If I win the lottery, I will buy a new house.",
        "The film, which was directed by a newcomer, won an award.",
        "They discussed the possibility that the project would fail.",
        "He behaves as if he owns the place.",
        "The bridge was destroyed by the flood.",
        "The letter had been sent by express mail.",
        "She likes to sing while driving.",
        "To err is human, to forgive divine.",
        "He admitted having stolen the money.",
        "Having lived in Paris, she knows French culture well.",
        "He is as kind as his father.",
        "The faster you drive, the greater the risk.",
        "You may enter if you have a ticket.",
        "He must have forgotten about the appointment.",
        "I would rather stay home than go out tonight.",
        "The teacher made the students repeat the words.",
        "They watched the sun setting over the ocean.",
        "No sooner had I arrived than it started raining.",
        "It was the dog that barked loudly.",
        "It is important for us to learn from our mistakes.",
        "He made it difficult for me to understand.",
        "The drought prevented the crops from growing.",
        "You've finished your homework, haven't you?",
        "She asked me if I knew the way to the station.",
        "Why don't we go for a walk?",
        "He finally gave up smoking.",
        "He explained that he had missed the bus.",
        "This is the woman whose advice helped me a lot.",
        "That's the reason why I love this city.",
        "The fact that she overcame such difficulties is inspiring.",
        "If only I had known the truth!",
        "He wants to know where I put his keys.",
        "The company, which manufactures electronics, is expanding.",
        "She couldn't understand why he was so angry.",
        "The idea that robots will replace humans is concerning.",
        "If he were taller, he would be a basketball player.",
        "By next month, I will have saved enough money for a trip.",
        "They were relieved by the news that no one was hurt.",
        "He made me promise to keep it a secret.",
        "The decision to cancel the flight was due to bad weather.",
        "The man running on the track is an athlete.",
        "He seemed worried, constantly checking his phone.",
        "She doesn't like spicy food, nor do I.",
        "The more challenging the task, the more rewarding the achievement.",
        "He should have told me earlier.",
        "You ought not to speak ill of others.",
        "I am looking forward to seeing you soon.",
        "Though it was expensive, I bought it.",
        "He studies hard so that he can pass the exam.",
        "She felt a chill run down her spine.",
        "It is often said that time flies.",
        "The student whose project won first place received a prize.",
        "This is the library where I study every day.",
        "The reason why the experiment failed was unclear.",
        "The fact that he finished the marathon is impressive.",
        "If it should rain, the event will be held indoors.",
        "The painting, which was priceless, was stolen.",
        "He ordered that the report (should) be submitted by Friday.",
        "The witness testified as if he had seen everything.",
        "The old car was repaired by a local mechanic.",
        "The report had been sent before the deadline.",
        "He enjoys playing video games in his free time.",
        "To forgive is to set a prisoner free.",
        "She denied having stolen the jewelry.",
        "Having prepared thoroughly, he felt confident.",
        "This car is more economical than that one.",
        "She is the prettiest girl I've ever seen.",
        "The sooner you start, the sooner you finish.",
        "You should have seen his face when he found out.",
        "He can't have forgotten his wallet.",
        "You'd better tell her the truth.",
        "She had her hair cut yesterday.",
        "I saw him enter the building.",
        "Only then did I realize my mistake.",
        "It was my brother who fixed the computer.",
        "It is essential to recycle waste.",
        "He made it possible for us to join the team.",
        "Lack of sleep often leads to poor concentration.",
        "You like coffee, don't you?",
        "He asked me how old I was.",
        "Why don't we try something new?",
        "She kept on talking despite the interruptions.",
        "He announced that he would retire next year.",
        "The writer whose novels are bestsellers is giving a lecture.",
        "This is the school where my children attend.",
        "The reason why she left was personal.",
        "The fact that he arrived on time surprised everyone.",
        "If I had gone there, I would have seen him.",
        "The documentary, which was very informative, won an award.",
        "They expressed the hope that peace would prevail.",
        "He talks as if he knows everything about computers.",
        "The ancient city was discovered by archaeologists.",
        "The new policy will have been implemented by next month.",
        "She enjoys listening to classical music.",
        "To know him is to love him.",
        "He denied having made the mistake.",
        "Having completed her studies, she looked for a job.",
        "He is not as tall as his father.",
        "The more money you earn, the more taxes you pay.",
        "You mustn't touch that button.",
        "We might go to the beach tomorrow.",
        "I'd rather watch a movie at home.",
        "The manager had the staff work overtime.",
        "I saw her walking towards the park.",
        "Hardly had I sat down when the phone rang.",
        "It was yesterday that I met him.",
        "It is crucial for students to participate in discussions.",
        "He made it known that he wanted a raise.",
        "The fog prevented the planes from taking off.",
        "She can speak German, can't she?",
        "He asked me what my favorite color was.",
        "Aren't you hungry?",
        "She took after her mother.",
        "He confirmed that the meeting had been postponed."
    ],
    "関係代名詞または関係副詞またはto不定詞または仮定法または同格that、関節疑問文": [
        "The book that I bought yesterday is very interesting.",
        "She's the woman who lives across the street.",
        "I visited the museum which houses ancient artifacts.",
        "He introduced me to his friend, whose sister is a famous artist.",
        "This is the city where I was born.",
        "I remember the day when we first met.",
        "That's the reason why he resigned from his position.",
        "He went to the library to study for his exam.",
        "I have a lot of things to do this weekend.",
        "I'm delighted to hear your good news.",
        "If I were a bird, I would fly to the highest mountain.",
        "If she had arrived earlier, she would have caught the train.",
        "The fact that he denied the allegations surprised everyone.",
        "I heard the news that the company will merge with another firm.",
        "Could you tell me where the nearest post office is?",
        "I wonder if he knows the answer to this complex problem.",
        "The car that is parked outside belongs to my neighbor.",
        "He's the student whom I recommended for the scholarship.",
        "The restaurant which we visited last night had excellent food.",
        "She showed me the photo of her dog, which won a prize.",
        "Do you remember the time when we used to play here?",
        "I don't understand how he managed to fix it so quickly.",
        "To forgive is divine.",
        "We decided to postpone the meeting until next week.",
        "It's too dark to see anything clearly.",
        "If I had more free time, I would learn a new language.",
        "I wish I could play the guitar as well as you.",
        "He acted as if nothing had happened.",
        "There is a possibility that the project will be delayed.",
        "My belief that hard work pays off has never wavered.",
        "He asked me what my favorite color was.",
        "Let me know when you are available for a chat.",
        "The phone that rang just now was for you.",
        "Anyone who wants to join should sign up here.",
        "This is the book about which I told you.",
        "She has a cat whose fur is incredibly soft.",
        "I want to go back to the place where we spent our honeymoon.",
        "Can you explain the reason why the system crashed?",
        "There's nothing to worry about.",
        "He worked hard only to fail the exam.",
        "It's important to listen carefully.",
        "If he had followed my advice, he wouldn't have gotten into trouble.",
        "I wish I had brought an umbrella.",
        "I'd rather you didn't smoke inside the house.",
        "The idea that all people are equal is fundamental to democracy.",
        "We received the report that sales have increased significantly.",
        "Could you explain how this machine works?",
        "I often wonder why birds sing in the morning.",
        "The key which opens this door is missing.",
        "We are looking for a candidate who has strong leadership skills.",
        "He repaired the computer that had been broken for weeks.",
        "This is the artist whose paintings are exhibited worldwide.",
        "We went to a cafe where they serve excellent coffee.",
        "Do you remember the year when the Berlin Wall fell?",
        "She bought some ingredients to bake a cake.",
        "My parents taught me to respect others.",
        "It is easy to make mistakes when you're tired.",
        "If I knew her address, I would send her an invitation.",
        "She spoke as though she were an expert on the subject.",
        "It's time you started thinking about your future.",
        "He expressed his hope that the negotiations would be successful.",
        "There is no doubt that she is the most qualified person.",
        "No one knew what caused the sudden power outage.",
        "Can you tell me what time the movie starts?",
        "The dog that barked loudly belongs to my neighbor.",
        "They hired a designer who specializes in modern architecture.",
        "The problems which they faced were numerous.",
        "He introduced me to the professor whose research is groundbreaking.",
        "Let's find a quiet place where we can talk.",
        "There was a time when cell phones were a luxury.",
        "I intend to finish this report by tomorrow.",
        "He worked quietly so as not to disturb anyone.",
        "We were shocked to hear about the accident.",
        "If we had left earlier, we would not have missed the flight.",
        "I wish I hadn't eaten so much.",
        "If I had paid attention in class, I would understand this now.",
        "The suggestion that we work overtime was met with resistance.",
        "He denied the rumor that he was leaving the company.",
        "I can't remember where I put my keys.",
        "Please tell me how you solved this complicated puzzle.",
        "The woman who called earlier left a message.",
        "This is the exact type of car that I want to buy.",
        "I appreciate everything that you have done for me.",
        "She has a friend whose parents own a vineyard.",
        "We need to find a new restaurant where we can celebrate.",
        "I look forward to the day when we can travel freely again.",
        "I have an important announcement to make.",
        "She studied hard enough to pass the exam.",
        "It is difficult to predict the future.",
        "If I were you, I would apologize immediately.",
        "I wish I were taller so I could reach that shelf.",
        "The old house stood silent as if it were haunted.",
        "The evidence that he was innocent was compelling.",
        "There is a strong feeling that changes are necessary.",
        "Do you have any idea when they will arrive?",
        "She couldn't decide whether to accept the offer or not.",
        "The cat that is sleeping on the sofa is very lazy.",
        "He's a man whom I respect greatly.",
        "The movie which we watched was a documentary.",
        "This is the painting whose value increased dramatically.",
        "This is the park where we used to play as children.",
        "I'll never forget the moment when I saw her for the first time.",
        "She practices every day to improve her skills.",
        "He is the right person to lead this team.",
        "It takes courage to speak up for what is right.",
        "If I had known about the party, I would have definitely come.",
        "I wish I had listened to my parents' advice.",
        "I'd rather stay home tonight than go out.",
        "The argument that climate change is a hoax is false.",
        "He announced the decision that the company would go public.",
        "Could you tell me what your intentions are?",
        "I'm not sure if this is the correct way to solve it.",
        "The package that arrived this morning is for you.",
        "He's the chef who prepared our delicious meal.",
        "The car, which was quite old, broke down on the highway.",
        "We met a couple whose daughter is a professional dancer.",
        "This is the office where all the important decisions are made.",
        "Christmas is a time when families gather together.",
        "They plan to open a new branch next year.",
        "She was overjoyed to receive the award.",
        "I don't know what to do next.",
        "If I had a magic wand, I would grant three wishes.",
        "He looked at me as though he had seen a ghost.",
        "She suggested that he be more careful.",
        "The news that the economy is recovering is encouraging.",
        "There is some truth that he was involved in the scandal.",
        "I need to find out who is responsible for this error.",
        "She wondered why he hadn't called her back.",
        "The person who invented this device deserves recognition.",
        "This is the film that won an Oscar last year.",
        "I saw the dog that chased the cat.",
        "They live in a house whose garden is full of roses.",
        "Do you remember the restaurant where we had our first date?",
        "There are moments when silence is the best answer.",
        "He trains every day to participate in the marathon.",
        "I have nothing to wear for the party.",
        "This coffee is too hot to drink.",
        "If you had told me earlier, I could have helped you.",
        "I wish it weren't raining right now.",
        "If you had listened to my advice, you wouldn't be in this mess now.",
        "The possibility that aliens exist has fascinated humans for centuries.",
        "He expressed his concern that the deadline might not be met.",
        "Please clarify what exactly you mean.",
        "I'm curious about how they managed to achieve such success.",
        "The team that won the championship celebrated all night.",
        "I met a professor whom I deeply admire.",
        "The novel, which was quite long, took me a week to read.",
        "We admired the building whose architecture was very unique.",
        "The internet is a place where information is readily available.",
        "The period when dinosaurs roamed the Earth was millions of years ago.",
        "We encouraged him to pursue his dreams.",
        "I was relieved to find my lost wallet.",
        "It is essential to be punctual for appointments.",
        "If I didn't have to work, I would travel the world.",
        "She looks as if she hasn't slept in days.",
        "It's time for us to leave now.",
        "The belief that everyone deserves a second chance is widely held.",
        "She ignored the warning that the ice was thin.",
        "Can you explain to me why you chose that option?",
        "I need to verify whether the information is accurate.",
        "The artist whose work is displayed here is very talented.",
        "This is the kind of job that requires a lot of patience.",
        "The person whom you spoke to is my manager.",
        "He bought a painting which cost a fortune.",
        "This is the precise moment when everything changed.",
        "I want to find a quiet cafe where I can read.",
        "She wears glasses to read small print.",
        "He needs someone to talk to about his problems.",
        "He worked hard enough to get a promotion.",
        "If I had known you were coming, I would have baked a cake.",
        "I wish I hadn't made that mistake.",
        "I'd rather not discuss that topic right now.",
        "The rumor that the president would resign proved to be false.",
        "There is a general perception that the economy is improving.",
        "Could you tell me what the capital of France is?",
        "I'm not sure if I remember his name correctly.",
        "The dog that is playing in the park is very energetic.",
        "She showed me the letter which she had received.",
        "He's the colleague whose dedication inspires everyone.",
        "The person who discovered penicillin was Alexander Fleming.",
        "That's the specific year when I graduated from college.",
        "My hometown is a peaceful place where I always feel comfortable.",
        "To learn a new skill requires dedication.",
        "We allowed them to use our facilities.",
        "I was sad to say goodbye to my friends.",
        "If I were taller, I could join the basketball team.",
        "The child behaved as though he were the only one in the room.",
        "The director demanded that all staff be present.",
        "The report that the endangered species is recovering gives us hope.",
        "I accept the fact that I made a mistake.",
        "Nobody knows why the stock market crashed suddenly.",
        "Can you find out who designed this building?",
        "The movie that we watched was really captivating.",
        "He is the only one who can solve this problem.",
        "The car whose engine was repaired now runs smoothly.",
        "I visited the Eiffel Tower, which is in Paris.",
        "That's the exact spot where we first met.",
        "I look forward to the future when technology will solve many problems.",
        "There is no easy way to achieve great success.",
        "Please inform me whether you will attend the conference."
    ],
    "関係代名詞または関係副詞またはto不定詞または仮定法または同格that、関節疑問文、省略した関係代名詞": [
        "If I were you, I wouldn't do that.",
        "If she had arrived earlier, she would have caught the train.",
        "I wish I could fly.",
        "He acts as if he were a king.",
        "If it should happen, what would you do?",
        "If he had listened to me, he wouldn't be in trouble now.",
        "Were I to go, I would tell you.",
        "Had I known, I would have told you.",
        "If you had told me, I would have helped.",
        "I wish I knew the answer.",
        "If he were rich, he would buy a car.",
        "If I had wings, I would fly.",
        "She wishes she were taller.",
        "I wish I hadn't eaten so much.",
        "If it were not for his help, I would have failed.",
        "But for your support, I couldn't have finished it.",
        "If I had studied, I would have passed.",
        "He talks as if he were an expert.",
        "If I could speak French, I would travel to France.",
        "If I were a bird, I would fly to you.",
        "If I were a millionaire, I would travel the world.",
        "If she had accepted the offer, she would be happy now.",
        "I wish I had remembered her birthday.",
        "He behaves as if he owned the place.",
        "Were it not for technology, life would be harder.",
        "Had I known your number, I would have called you.",
        "If he were taller, he could reach it.",
        "I wish I could speak Japanese fluently.",
        "If I had finished my homework, I could go out.",
        "If you were here, I wouldn't be lonely.",
        "I wish it would stop raining.",
        "He speaks as if he knew everything.",
        "If I could turn back time, I would.",
        "The man who called me was my uncle.",
        "This is the book which I read yesterday.",
        "I know the girl whose dog ran away.",
        "She is the woman whom I met at the party.",
        "The car that broke down was ours.",
        "He has a friend who lives in Canada.",
        "I saw a movie that was very moving.",
        "The city which I visited was beautiful.",
        "This is the house where he grew up.",
        "Do you know the reason why she left?",
        "I remember the day when we first met.",
        "That's the way how he solved the problem.",
        "The girl who won the race is my sister.",
        "I bought a jacket that was on sale.",
        "This is the pen with which I write.",
        "He's the kind of person who always helps others.",
        "The restaurant where we had dinner was excellent.",
        "I don't like the noise that you are making.",
        "She has a cat whose fur is very soft.",
        "The problem which we discussed was complex.",
        "The woman who lives next door is a doctor.",
        "This is the car that I want to buy.",
        "I know the place where they met.",
        "Tell me the day when you were born.",
        "The reason why he's angry is unclear.",
        "That's the way how they fixed it.",
        "The boy whose bike was stolen is sad.",
        "I saw a bird which had a broken wing.",
        "This is the person whom I admire.",
        "The city where I grew up is small.",
        "I remember the moment when I realized it.",
        "He explained the reason why he was late.",
        "The tool which he used was broken.",
        "The students who study hard will succeed.",
        "This is the book I bought yesterday.",
        "The man I saw was my uncle.",
        "I like the song you are listening to.",
        "The car he bought is red.",
        "The woman she introduced me to was kind.",
        "This is the story I heard.",
        "The movie we watched was boring.",
        "I lost the key you gave me.",
        "The present I received was nice.",
        "He returned the money he borrowed.",
        "She is the person I admire most.",
        "The meal we had was delicious.",
        "This is the house I want to buy.",
        "The problem he solved was difficult.",
        "The email I sent was important.",
        "The advice you gave me was helpful.",
        "The dress she wore was beautiful.",
        "The friend I met yesterday was happy.",
        "The show I watched was exciting.",
        "The job I want is challenging.",
        "The food I ate was delicious.",
        "The email I received was important.",
        "This is the song I like most.",
        "The book you recommended was great.",
        "The jacket I bought is too big.",
        "The place we visited was amazing.",
        "The movie I saw was thrilling.",
        "The person I called didn't answer.",
        "The car he drives is expensive.",
        "The story she told was interesting.",
        "The things I learned were valuable.",
        "The gift I got was perfect.",
        "The person I respect most is my mother.",
        "I want to learn English.",
        "She decided to go to college.",
        "It's important to study hard.",
        "He has a dream to become a doctor.",
        "I came here to see you.",
        "To be honest, I don't like it.",
        "She tried to open the door.",
        "We need to work together.",
        "He promised to help me.",
        "I have nothing to say.",
        "It's easy to make mistakes.",
        "He seems to be happy.",
        "I'm glad to see you.",
        "She paused to catch her breath.",
        "He lives to eat.",
        "She is too shy to speak.",
        "I have a lot of work to do.",
        "He refused to accept the offer.",
        "She is determined to succeed.",
        "He needs money to buy a car.",
        "He hopes to visit Japan someday.",
        "It's difficult to master a foreign language.",
        "I went to the store to buy milk.",
        "She has a tendency to complain.",
        "He seemed to be angry.",
        "I have a lot of things to learn.",
        "It's time to go home.",
        "She is determined to finish the race.",
        "He decided not to give up.",
        "We plan to travel next year.",
        "She needs to find a new job.",
        "It's essential to stay hydrated.",
        "The fact that he failed surprised us all.",
        "I heard the news that she got married.",
        "He expressed the hope that she would recover soon.",
        "The rumor that he resigned is true.",
        "She accepted the idea that change is necessary.",
        "We discussed the possibility that he might come.",
        "There's a strong belief that hard work pays off.",
        "The theory that the universe is expanding is widely accepted.",
        "He denied the accusation that he stole the money.",
        "I have no doubt that he will succeed.",
        "The report that the economy is improving is encouraging.",
        "She held the opinion that everyone should be treated equally.",
        "The evidence that he was guilty was overwhelming.",
        "They confirmed the fact that the meeting was canceled.",
        "The notion that money can buy happiness is false.",
        "He conveyed the message that he was sorry.",
        "The promise that he would return was kept.",
        "She welcomed the suggestion that they take a break.",
        "The observation that the Earth is round is ancient.",
        "The announcement that the concert was postponed disappointed fans.",
        "The idea that he might quit worried us.",
        "I received the news that the project was approved.",
        "She expressed her fear that she would fail.",
        "The fact that she is fluent in three languages is impressive.",
        "He firmly believes the principle that honesty is the best policy.",
        "The suggestion that we postpone the meeting was accepted.",
        "There's a strong possibility that he will win.",
        "The rumor that the company is closing is false.",
        "She denied the claim that she was involved.",
        "We discussed the fact that many people struggle.",
        "The observation that the climate is changing is alarming.",
        "I don't know where he lives.",
        "She asked me what time it was.",
        "Could you tell me if he is coming?",
        "I wonder whether she likes me.",
        "He asked why I was late.",
        "Tell me how you did that.",
        "Do you know what she wants?",
        "I can't remember when I met him.",
        "Please tell me who broke the window.",
        "I asked him which book he preferred.",
        "He explained why the sky is blue.",
        "She wondered what to do next.",
        "Do you know what time the store opens?",
        "I'm not sure if I can make it.",
        "He asked me how much it cost.",
        "I need to find out where the station is.",
        "She wants to know when the bus arrives.",
        "Could you tell me what your name is?",
        "I don't understand why he left.",
        "He wondered if it was too late.",
        "I wonder where my keys are.",
        "She asked what his name was.",
        "Can you tell me if the train is on time?",
        "He wants to know whether I'm available.",
        "I don't understand why he did that.",
        "Could you explain how this machine works?",
        "She asked me what I was doing.",
        "I need to find out when the next flight is.",
        "Do you know who took my umbrella?",
        "I'm not sure which way to go.",
        "He asked why the sky is blue.",
        "She wondered what she should wear.",
        "Do you know what the capital of France is?",
        "I'm not certain if he will come."
    ],
    "関係代名詞(主格)、関係代名詞(目的格)、関係副詞、関節疑問文、同格that": [
        "The dog that barks loudly belongs to my neighbor.",
        "She met a man who claimed to be a famous artist.",
        "I bought a book which was recommended by my friend.",
        "He has a car that always breaks down.",
        "We saw a bird that had a broken wing.",
        "The student who aced the test received a scholarship.",
        "This is the movie that won several awards.",
        "I know a person who speaks five languages fluently.",
        "They built a bridge which connects the two islands.",
        "She wore a dress that sparkled in the light.",
        "The scientist who discovered the cure became famous.",
        "I have a friend who lives in Australia.",
        "He adopted a cat that loves to play.",
        "This is the restaurant that serves the best sushi.",
        "The team which won the championship celebrated all night.",
        "She received a gift that made her very happy.",
        "I admire people who are always optimistic.",
        "They live in a house that overlooks the ocean.",
        "He repaired the machine which was faulty.",
        "The child who found the lost puppy was praised.",
        "We visited a museum that housed ancient artifacts.",
        "She told a story that moved everyone to tears.",
        "The project that received the most votes was chosen.",
        "I saw a painting which depicted a rural scene.",
        "He is a writer who focuses on science fiction.",
        "They watched a show that featured acrobats.",
        "The teacher who assigned the homework is very strict.",
        "I enjoy books that challenge my thinking.",
        "She bought flowers which smelled wonderful.",
        "The company that produces these gadgets is innovative.",
        "He is the person who always helps others.",
        "We ate at a cafe that had live music.",
        "The technology which powers these devices is complex.",
        "She has a dream that she hopes to achieve.",
        "The player who scored the winning goal was cheered.",
        "I read an article that discussed climate change.",
        "They own a farm that grows organic vegetables.",
        "He recommended a film that truly inspired me.",
        "This is the software that crashed my computer.",
        "The politician who made that promise lost credibility.",
        "The woman whom I saw at the party smiled at me.",
        "This is the book that I was telling you about.",
        "He showed me the car which he bought last week.",
        "The friend whom I invited couldn't make it.",
        "That's the song that everyone loves to sing.",
        "She found the keys which she had lost yesterday.",
        "The person whom you met earlier is my cousin.",
        "This is the problem that we need to solve.",
        "I visited the city which I had always wanted to see.",
        "He introduced me to the colleagues whom he works with.",
        "The advice that you gave me was very helpful.",
        "We watched the movie which you recommended.",
        "Is this the pen that you were looking for?",
        "The artist whom I admire lives in Paris.",
        "She cooked a meal which everyone enjoyed.",
        "The house that they bought needs renovation.",
        "He is the man whom I had a meeting with.",
        "I read the email that you sent me this morning.",
        "The decision which they made surprised us all.",
        "This is the gift that I received for my birthday.",
        "The dog whom I rescued is now very healthy.",
        "I can't find the document that I need.",
        "She wore the necklace which her grandmother gave her.",
        "The manager whom we spoke to was very understanding.",
        "That's the idea that I was trying to explain.",
        "He showed me the photos which he took on his trip.",
        "The project that I completed last week was challenging.",
        "They are the people whom I trust the most.",
        "This is the story which I heard on the news.",
        "The task that he assigned was quite difficult.",
        "I saw the painting which you described to me.",
        "She finally found the wallet that she had misplaced.",
        "The professor whom I respect greatly teaches history.",
        "This is the information that I gathered for the report.",
        "The concert which we attended was spectacular.",
        "He recognized the tune that his mother used to sing.",
        "The challenge that they faced was immense.",
        "I admire the dedication which she shows in her work.",
        "They ate the food that I prepared for dinner.",
        "The novel that I'm reading is incredibly gripping.",
        "This is the park where we used to play as children.",
        "I remember the year when we first moved here.",
        "Do you know the reason why he quit his job?",
        "We visited the town where my grandparents were born.",
        "I'll never forget the day when we graduated.",
        "That's the café where we had our first date.",
        "Can you tell me the reason why the train was delayed?",
        "August is the month when many people go on vacation.",
        "He returned to the place where he grew up.",
        "Spring is the season when flowers bloom everywhere.",
        "There's a store nearby where you can buy fresh produce.",
        "I'm curious about the reason why she changed her mind.",
        "The exact moment when the accident happened is unclear.",
        "This is the library where I study for my exams.",
        "Friday is the day when we usually have our team meeting.",
        "She explained the reason why she chose that career.",
        "I want to visit the country where my ancestors lived.",
        "Christmas Eve is the night when Santa visits.",
        "The office where I work is downtown.",
        "Let me know the time when you'll be free.",
        "Is there a specific reason why you're asking?",
        "They showed us the factory where the cars are assembled.",
        "The summer when I turned eighteen was memorable.",
        "This is the restaurant where we celebrated our anniversary.",
        "I don't understand the reason why he behaved that way.",
        "We found a secluded spot where we could picnic.",
        "The period when disco music was popular was fun.",
        "He pointed to the building where his company is located.",
        "Tell me the occasion when you felt most proud.",
        "She shared the reason why she moved to another city.",
        "I often think about the village where I spent my childhood.",
        "The historical era when castles were built was fascinating.",
        "They are building a new shopping mall where the old factory stood.",
        "Do you recall the exact date when the event occurred?",
        "I still don't know the full reason why the project failed.",
        "This is the park where we often walk our dog.",
        "The moment when I realized my mistake was humbling.",
        "He showed us the lab where all the experiments take place.",
        "There are times when I just want to relax.",
        "Can you explain the reason why the system crashed?",
        "I wonder what time the movie starts.",
        "Could you tell me where the nearest post office is?",
        "She asked if I was coming to the party.",
        "He wants to know why you left so early.",
        "Do you remember when we last met?",
        "I'm not sure how much it costs.",
        "They need to decide whether to accept the offer.",
        "We discussed what our next steps should be.",
        "Can you explain how this machine works?",
        "I asked him if he had finished his homework.",
        "The police are investigating why the accident happened.",
        "She wondered what she should do next.",
        "Let me know where you'd like to meet.",
        "He inquired if the flight was on time.",
        "I can't imagine why anyone would do that.",
        "Do you know who called me yesterday?",
        "We need to figure out what the problem is.",
        "Could you please tell me how to get to the station?",
        "I'm curious whether they will join us.",
        "He asked what my favorite color was.",
        "The children wanted to know when Christmas would come.",
        "They couldn't explain why the power went out.",
        "I'd like to know if you're available tomorrow.",
        "She asked him where he was going.",
        "We need to determine how we can improve.",
        "Tell me what your plans are for the weekend.",
        "I asked the teacher if the test was difficult.",
        "He wondered whether it would rain later.",
        "Do you have any idea why the shop is closed?",
        "I'm trying to remember what her name is.",
        "Could you show me how to use this software?",
        "She asked if I could lend her some money.",
        "He wants to know where the nearest ATM is.",
        "I'm not sure when they will arrive.",
        "Let's find out what's causing the issue.",
        "The manager asked whether the report was ready.",
        "I have no idea why he reacted that way.",
        "Do you know if this train goes to London?",
        "She wanted to know how long the journey would take.",
        "Tell me what your biggest dream is.",
        "The fact that he arrived late caused a delay.",
        "I have a strong belief that she will succeed.",
        "There's no doubt that he is the best candidate.",
        "She shared the news that she got promoted.",
        "The idea that we could fly to the moon was once absurd.",
        "He expressed his hope that peace would prevail.",
        "I cannot deny the truth that I was mistaken.",
        "The rumor that the company is closing is false.",
        "We accepted the possibility that it might rain.",
        "She found comfort in the thought that she wasn't alone.",
        "The evidence that he was guilty was overwhelming.",
        "There is a general consensus that climate change is real.",
        "He announced the decision that they would merge.",
        "My biggest fear is that I might fail.",
        "The understanding that they reached was crucial.",
        "It's a miracle that he survived the accident.",
        "She ignored the warning that the ice was thin.",
        "The theory that the universe is expanding is widely accepted.",
        "I appreciate the confidence that you place in me.",
        "The suggestion that we work together was welcomed.",
        "There is little chance that he will change his mind.",
        "He revealed the secret that he had been hiding.",
        "The belief that honesty is the best policy guides her.",
        "We were surprised by the report that sales increased.",
        "The concept that time travel is possible fascinates me.",
        "She clung to the hope that her pet would return.",
        "The certainty that he would win was evident.",
        "They discussed the fact that resources were limited.",
        "I dismissed the idea that ghosts exist.",
        "The promise that he made was never kept.",
        "There's a strong indication that the market is recovering.",
        "He struggled with the realization that he was alone.",
        "The agreement that they signed was legally binding.",
        "She expressed her concern that the deadline was too tight.",
        "The knowledge that she had done her best comforted her.",
        "It's a known fact that exercise improves health.",
        "The speculation that prices would rise proved correct.",
        "We heard the rumor that they are getting married.",
        "He conveyed his opinion that the plan was flawed.",
        "The conclusion that more research is needed was unanimous."
    ]
}